trade/src/Enums/УдалитьТипыНалогов/УдалитьТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УдалитьТипыНалогов</name>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДС_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДС_ОбратноеОбложение</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ОПСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОМСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОССИностранныхРаботников</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ВидыНалоговВзносов/ВидыНалоговВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалоговВзносов</name>
  <predefined>
    <items>
      <name>ЕдиныйНалоговыйПлатеж</name>
      <description>Единый налоговый платеж</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>ЕНВД</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>ЕСХН</description>
    </items>
    <items>
      <name>ЗемельныйНалог</name>
      <description>Земельный налог</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество организаций</description>
    </items>
    <items>
      <name>НалогНаПрибыль_РегиональныйБюджет</name>
      <description>Налог на прибыль, региональный бюджет</description>
    </items>
    <items>
      <name>НалогНаПрибыль_ФедеральныйБюджет</name>
      <description>Налог на прибыль, федеральный бюджет</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>НДС_ВвозимыеТовары</name>
      <description>НДС при импорте товаров из ЕАЭС</description>
    </items>
    <items>
      <name>НДС_НалоговыйАгент</name>
      <description>НДС при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ_ИП</name>
      <description>НДФЛ индивидуального предпринимателя </description>
    </items>
    <items>
      <name>ПрочиеНалогиИСборы</name>
      <description>Прочие налоги и сборы</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ТранспортныйНалог</name>
      <description>Транспортный налог организаций</description>
    </items>
    <items>
      <name>УСН_Доходы</name>
      <description>Налог при УСН (доходы)</description>
    </items>
    <items>
      <name>УСН_ДоходыМинусРасходы</name>
      <description>Налог при УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>УСН_МинимальныйНалог</name>
      <description>Минимальный налог УСН</description>
    </items>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>ПФР - по суммарному тарифу с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРСтраховаяЧасть</name>
      <description>Страховые взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительнаяЧасть</name>
      <description>Страховые взносы в ПФР, накопительная часть (до 2014 г.)</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифЛЭ</name>
      <description>Взносы на выплату доплат к пенсии членам летных экипажей</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифШахтеры</name>
      <description>Взносы на выплату доплат к пенсии шахтерам</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)</description>
    </items>
    <items>
      <name>ПФРСПревышения</name>
      <description>ПФР - с базы сверх предельной величины, с 1 января 2016 года</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>ТФОМС</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССНС</name>
      <description>Страховые взносы от несчастных случаев</description>
    </items>
    <items>
      <name>НДФЛДоходыКонтрагентов</name>
      <description>НДФЛ с доходов контрагентов</description>
    </items>
    <items>
      <name>НДФЛДивиденды</name>
      <description>НДФЛ с дивидендов</description>
    </items>
    <items>
      <name>НДФЛДивидендыСотрудникам</name>
      <description>НДФЛ с дивидендов работникам</description>
    </items>
    <items>
      <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
      <description>НДФЛ, доначисленный по результатам проверки</description>
    </items>
    <items>
      <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
      <description>НДФЛ передача задолженности в налоговый орган</description>
    </items>
    <items>
      <name>НДФЛПрочиеРасчетыСПерсоналом</name>
      <description>НДФЛ с доходов по прочим операциям с персоналом</description>
    </items>
    <items>
      <name>НДФЛСПревышения</name>
      <description>НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>НДФЛДивидендыСПревышения</name>
      <description>НДФЛ с дивидендов свыше предельной величины</description>
    </items>
    <items>
      <name>ПФРДоПредельнойВеличины</name>
      <description>ПФР - с базы до предельной величины</description>
    </items>
    <items>
      <name>НДС_ОбратноеОбложение</name>
      <description>НДС налогового агента по отдельным видам товаров</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Налог при АУСН</description>
    </items>
    <items>
      <name>СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы по единому тарифу</description>
    </items>
    <items>
      <name>ОПСИностранныхРаботников</name>
      <description>Взносы на пенсионное страхование иностранных работников</description>
    </items>
    <items>
      <name>ОМСИностранныхРаботников</name>
      <description>Взносы на медицинское страхование иностранных работников</description>
    </items>
    <items>
      <name>ОССИностранныхРаботников</name>
      <description>Взносы на социальное страхование иностранных работников</description>
    </items>
    <items>
      <name>НалогНаПрибыль_НалоговыйАгент</name>
      <description>Налог на прибыль при исполнении обязанностей налогового агента</description>
    </items>
  </predefined>
  <attributes>
    <name>ПлательщикСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Enums/УдалитьТипыНалогов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ссылку на справочник виды налогов взносов по перечислению типу налогов.
// 
// Параметры:
//  ТипНалога - ПеречислениеСсылка.УдалитьТипыНалогов
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыНалоговВзносов - Ссылка виды налогов взносов по типу налогов
Функция СсылкаВидыНалоговВзносовПоТипуНалогов(ТипНалога) Экспорт
	Если НЕ ТипЗнч(ТипНалога) = Тип("ПеречислениеСсылка.УдалитьТипыНалогов") Тогда
		Возврат ТипНалога;
	КонецЕсли;
	Если ТипНалога = Перечисления.УдалитьТипыНалогов.ПустаяСсылка() Тогда
		Возврат Справочники.ВидыНалоговВзносов.ПустаяСсылка();
	КонецЕсли;
	Индекс = Перечисления.УдалитьТипыНалогов.Индекс(ТипНалога);
	МетаданныеПеречисления = ТипНалога.Метаданные().ЗначенияПеречисления[Индекс];
	Ссылка = Справочники.ВидыНалоговВзносов.ПолучитьСсылкуПредопределенногоЭлемента(МетаданныеПеречисления.Имя);
	Возврат Ссылка;
КонецФункции

// Заполняет значение нового реквизита Объекта с типом Справочник.ВидыНалоговВзносов 
// на основании старого удаляемого реквизита с типом Перечисление.УдалитьТипыНалогов.
// 
// Параметры:
//  Объект - ДокументОбъект, СправочникОбъект
//	СтарыйРеквизит - Строка
//	НовыйРеквизит - Строка
Процедура ЗаполнитьРеквизитТипНалога(Объект, СтарыйРеквизит, НовыйРеквизит = Неопределено) Экспорт
	
	МассивПути = СтрРазделить(СтарыйРеквизит, ".");
	ЭтоТабличнаяЧасть = МассивПути.Количество() = 2;
	
	Если ЭтоТабличнаяЧасть Тогда
		ИмяТабличнойЧасти = МассивПути[0];
		СтарыйРеквизит = МассивПути[1];
		Для Каждого Строка Из Объект[ИмяТабличнойЧасти] Цикл
			Если НовыйРеквизит = Неопределено Тогда
				Строка[СтарыйРеквизит] = СсылкаВидыНалоговВзносовПоТипуНалогов(Строка[СтарыйРеквизит]);
			Иначе 
				Строка[НовыйРеквизит] = СсылкаВидыНалоговВзносовПоТипуНалогов(Строка[СтарыйРеквизит]);
				Строка[СтарыйРеквизит] = Неопределено;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НовыйРеквизит = Неопределено Тогда
			Объект[СтарыйРеквизит]= СсылкаВидыНалоговВзносовПоТипуНалогов(Объект[СтарыйРеквизит]);
		Иначе
			Объект[НовыйРеквизит]= СсылкаВидыНалоговВзносовПоТипуНалогов(Объект[СтарыйРеквизит]);
			Объект[СтарыйРеквизит] = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Наименование предопределенного элемента.
// 
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента
// 
// Возвращаемое значение:
//  Строка - Наименование предопределенного элемента
Функция НаименованиеПредопределенногоЭлемента(ИмяПредопределенного) Экспорт
	Если ИмяПредопределенного = "ЕдиныйНалоговыйПлатеж" Тогда
		Возврат "ru = 'Единый налоговый платеж'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ЕНВД" Тогда
		Возврат "ru = 'ЕНВД'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ЕСХН" Тогда
		Возврат "ru = 'ЕСХН'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ЗемельныйНалог" Тогда
		Возврат "ru = 'Земельный налог'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НалогНаИмущество" Тогда
		Возврат "ru = 'Налог на имущество организаций'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НалогНаПрибыль_РегиональныйБюджет" Тогда
		Возврат "ru = 'Налог на прибыль, региональный бюджет'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НалогНаПрибыль_ФедеральныйБюджет" Тогда
		Возврат "ru = 'Налог на прибыль, федеральный бюджет'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НалогНаПрибыль_НалоговыйАгент" Тогда
		Возврат "ru = 'Налог на прибыль при исполнении обязанностей налогового агента'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДС" Тогда
		Возврат "ru = 'НДС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДС_ВвозимыеТовары" Тогда
		Возврат "ru = 'НДС при импорте товаров из ЕАЭС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДС_НалоговыйАгент" Тогда
		Возврат "ru = 'НДС при исполнении обязанностей налогового агента'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛ" Тогда
		Возврат "ru = 'НДФЛ при исполнении обязанностей налогового агента'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛ_ИП" Тогда
		Возврат "ru = 'НДФЛ индивидуального предпринимателя '"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПрочиеНалогиИСборы" Тогда
		Возврат "ru = 'Прочие налоги и сборы'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ТорговыйСбор" Тогда
		Возврат "ru = 'Торговый сбор'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ТранспортныйНалог" Тогда
		Возврат "ru = 'Транспортный налог организаций'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "УСН_Доходы" Тогда
		Возврат "ru = 'Налог при УСН (доходы)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "УСН_ДоходыМинусРасходы" Тогда
		Возврат "ru = 'Налог при УСН (доходы минус расходы)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "УСН_МинимальныйНалог" Тогда
		Возврат "ru = 'Минимальный налог УСН'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРПоСуммарномуТарифу" Тогда
		Возврат "ru = 'ПФР - по суммарному тарифу с 1 января 2014 года'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРСтраховаяЧасть" Тогда
		Возврат "ru = 'Страховые взносы в ПФР'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРНакопительнаяЧасть" Тогда
		Возврат "ru = 'Страховые взносы в ПФР, накопительная часть (до 2014 г.)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРДополнительныйТарифЛЭ" Тогда
		Возврат "ru = 'Взносы на выплату доплат к пенсии членам летных экипажей'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРДополнительныйТарифШахтеры" Тогда
		Возврат "ru = 'Взносы в ПФР (дополнительный тариф шахтеров)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах" Тогда
		Возврат "ru = 'Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах" Тогда
		Возврат "ru = 'Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРСПревышения" Тогда
		Возврат "ru = 'ПФР - с базы сверх предельной величины, с 1 января 2016 года'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ФФОМС" Тогда
		Возврат "ru = 'Страховые взносы в ФФОМС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ТФОМС" Тогда
		Возврат "ru = 'ТФОМС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ФСС" Тогда
		Возврат "ru = 'Страховые взносы в ФСС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ФССНС" Тогда
		Возврат "ru = 'Страховые взносы от несчастных случаев'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛДоходыКонтрагентов" Тогда
		Возврат "ru = 'НДФЛ с доходов контрагентов'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛДивиденды" Тогда
		Возврат "ru = 'НДФЛ с дивидендов'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛДивидендыСотрудникам" Тогда
		Возврат "ru = 'НДФЛ с дивидендов работникам'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛДоначисленныйПоРезультатамПроверки" Тогда
		Возврат "ru = 'НДФЛ, доначисленный по результатам проверки'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда
		Возврат "ru = 'НДФЛ передача задолженности в налоговый орган'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛПрочиеРасчетыСПерсоналом" Тогда
		Возврат "ru = 'НДФЛ с доходов по прочим операциям с персоналом'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛСПревышения" Тогда
		Возврат "ru = 'НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДФЛДивидендыСПревышения" Тогда
		Возврат "ru = 'НДФЛ с дивидендов свыше предельной величины'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ПФРДоПредельнойВеличины" Тогда
		Возврат "ru = 'ПФР - с базы до предельной величины'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДС_ОбратноеОбложение" Тогда
		Возврат "ru = 'НДС налогового агента по отдельным видам товаров'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "АУСН" Тогда
		Возврат "ru = 'Налог при АУСН'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "СтраховыеВзносыЕдиныйТариф" Тогда
		Возврат "ru = 'Страховые взносы по единому тарифу'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ОПСИностранныхРаботников" Тогда
		Возврат "ru = 'Взносы на пенсионное страхование иностранных работников'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ОМСИностранныхРаботников" Тогда
		Возврат "ru = 'Взносы на медицинское страхование иностранных работников'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "ОССИностранныхРаботников" Тогда
		Возврат "ru = 'Взносы на социальное страхование иностранных работников'"; // @НСтр-1
	КонецЕсли;
КонецФункции
#КонецОбласти

#КонецЕсли
